app/controllers/movies_controller.rb

INSERT INTO "movies" ("id", "title", "poster_path", "release_date", "vote_average", "overview", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @movie = Movie.create(movie_params)