app/controllers/movie_genres_controller.rb

    def index
        @movieGenres = MovieGenre.all
---
SELECT "movie_genres".* FROM "movie_genres"

    def create
        @movieGenre = MovieGenre.create(movieGenre_params)
---
INSERT INTO "movie_genres" ("movie_id", "genre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 454626], ["genre_id", 10751], ["created_at", "2020-04-17 15:08:30.344553"], ["updated_at", "2020-04-17 15:08:30.344553"]]
INSERT INTO "movies" ("id", "title", "poster_path", "release_date", "vote_average", "overview", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"