app/controllers/user_movies_controller.rb

SELECT "user_movies".* FROM "user_movies"
---
    def index
        @userMovies = UserMovie.all

INSERT INTO "user_movies" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["movie_id", 522627], ["created_at", "2020-04-15 14:33:44.203168"], ["updated_at", "2020-04-15 14:33:44.203168"]]
---
    def create
        @userMovie = UserMovie.create(userMovie_params)

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @userMovie= UserMovie.find(params[:id])

SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_movies" WHERE "user_movies"."id" = $1  [["id", 3]]
---
    def destroy
        @userMovie = UserMovie.find(params[:id])
        @userMovie.destroy